Get a copy of the edge or curve reference.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public Reference GetEdgeReference()
  Visual Basic
Public Function GetEdgeReference As Reference
  Visual C++
public:
Reference^ GetEdgeReference()
 See Also
  PointOnEdgeFaceIntersection Class
  Autodesk.Revit.DB Namespace